Tekla Open API Reference for Tekla Structures 2025
Position.PlaneEnum Enumeration
 The position in the plane sense.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum PlaneEnum
Public Enumeration PlaneEnum
Members
Member name | Value | Description
MIDDLE | 0 |  The middle option.
LEFT | 1 |  The left option.
RIGHT | 2 |  The right option.
See Also
Reference
Tekla.Structures.Model Namespace